{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String",
      "metadata": {
        "description": "Microsoft Sentinel Workspace Name"
      }
    }
  },
  "resources": [
    {
      "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'), '/alertRules/74b26ff3-490e-4ec8-93f5-222db64deec1')]",
      "name": "[concat(parameters('workspace'), '/Microsoft.SecurityInsights/74b26ff3-490e-4ec8-93f5-222db64deec1')]",
      "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules",
      "kind": "Scheduled",
      "apiVersion": "2023-12-01-preview",
      "properties": {
        "displayName": "Brute-Force Authentication Detection",
        "description": "Detects potential brute-force password attacks by identifying multiple failed authentication attempts for the same account within a short time window.",
        "severity": "Medium",
        "enabled": true,

        "query": "SecurityEvent\n| where EventID == 4625\n| where Account !endswith \"$\"\n| summarize FailedAttempts = count()\n    by Account, Computer, IpAddress, AuthenticationPackageName,\n       bin(TimeGenerated, 5m)\n| where FailedAttempts >= 5\n| extend\n    AccountEntity = Account,\n    HostEntity = Computer,\n    IPEntity = IpAddress",

        "queryFrequency": "PT5M",
        "queryPeriod": "PT30M",

        "triggerOperator": "GreaterThanOrEqual",
        "triggerThreshold": 1,

        "suppressionEnabled": false,
        "suppressionDuration": "PT5H",

        "tactics": [
          "InitialAccess",
          "CredentialAccess",
          "PrivilegeEscalation"
        ],
        "techniques": [
          "T1110"
        ],
        "subTechniques": [],

        "incidentConfiguration": {
          "createIncident": true,
          "groupingConfiguration": {
            "enabled": true,
            "reopenClosedIncident": false,
            "lookbackDuration": "PT5H",
            "matchingMethod": "AllEntities",
            "groupByEntities": [],
            "groupByAlertDetails": [],
            "groupByCustomDetails": []
          }
        },

        "eventGroupingSettings": {
          "aggregationKind": "SingleAlert"
        },

        "entityMappings": [
          {
            "entityType": "Account",
            "fieldMappings": [
              {
                "identifier": "FullName",
                "columnName": "Account"
              }
            ]
          },
          {
            "entityType": "Host",
            "fieldMappings": [
              {
                "identifier": "HostName",
                "columnName": "Computer"
              }
            ]
          },
          {
            "entityType": "IP",
            "fieldMappings": [
              {
                "identifier": "Address",
                "columnName": "IpAddress"
              }
            ]
          }
        ],

        "customDetails": {
          "FailedAttempts": "FailedAttempts",
          "AuthenticationPackage": "AuthenticationPackageName"
        }
      }
    }
  ]
}
